In [3]:
import pandas as pd
import numpy as np
d= {
    'A': [1,2,np.nan],
    'B': [5,np.nan,np.nan],
    'C': [1,2,3]
}
df=pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [4]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [5]:
df.dropna(axis=0)

     A    B  C
0  1.0  5.0  1

In [6]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [7]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [8]:
df.fillna(value='Filling Value')

               A              B  C
0            1.0            5.0  1
1            2.0  Filling Value  2
2  Filling Value  Filling Value  3

In [10]:
df=pd.DataFrame(d)
a=df['A'].fillna(value=df['A'].mean())
df
a

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [11]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [12]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [13]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [18]:
df['A'].fillna(value = df['A'].mean(), inplace = True)
df

C:\Users\Sudharsan\AppData\Local\Temp\ipykernel_15744\4028766332.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['A'].fillna(value = df['A'].mean(), inplace = True)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3

In [20]:
data={
    'Company':['Google','Google','MSFT','FB','FB','IBM'],
    'Person':['Sam','Nihad','Any','Van','Rakib','Ovi'],
    'Sales':[200,120,340,124,243,350]
}
df=pd.DataFrame(data)
df

  Company Person  Sales
0  Google    Sam    200
1  Google  Nihad    120
2    MSFT    Any    340
3      FB    Van    124
4      FB  Rakib    243
5     IBM    Ovi    350

In [22]:
byComp=df.groupby('Company')
byComp.mean(numeric_only=True)

         Sales
Company
FB       183.5
Google   160.0
IBM      350.0
MSFT     340.0

In [24]:
byComp.sum()

           Person  Sales
Company
FB       VanRakib    367
Google   SamNihad    320
IBM           Ovi    350
MSFT          Any    340

In [25]:
df

  Company Person  Sales
0  Google    Sam    200
1  Google  Nihad    120
2    MSFT    Any    340
3      FB    Van    124
4      FB  Rakib    243
5     IBM    Ovi    350

In [27]:
byComp.std(numeric_only=True)

             Sales
Company
FB       84.145707
Google   56.568542
IBM            NaN
MSFT           NaN

In [28]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
Google        2      2
IBM           1      1
MSFT          1      1

In [29]:
df

  Company Person  Sales
0  Google    Sam    200
1  Google  Nihad    120
2    MSFT    Any    340
3      FB    Van    124
4      FB  Rakib    243
5     IBM    Ovi    350

In [30]:
df.groupby('Company').describe()

        Sales
        count   mean        std    min     25%    50%     75%    max
Company
FB        2.0  183.5  84.145707  124.0  153.75  183.5  213.25  243.0
Google    2.0  160.0  56.568542  120.0  140.00  160.0  180.00  200.0
IBM       1.0  350.0        NaN  350.0  350.00  350.0  350.00  350.0
MSFT      1.0  340.0        NaN  340.0  340.00  340.0  340.00  340.0

In [31]:
df1=pd.DataFrame(np.random.randint(1,20,size=(4,3)),[1,2,3,4],['W','X',
df2=pd.DataFrame(np.random.randint(20,40,size=(4,3)),[5,6,7,8],['W','X',
df3=pd.DataFrame(np.random.randint(40,60,size=(4,3)),[9,10,11,12],['W','
df1

SyntaxError: unterminated string literal (detected at line 3) (1182910424.py, line 3)